package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

public class Solution
{
    public static void main(String[] args)
    {
       String s="Я не хочу изучать Java, я хочу большую зарплату";
        int b=0;
        for (b=0; b<10; b++)
        System.out.println(s);//Напишите тут ваш код
    }
}
